#!/bin/bash

#Cкрипт выполняет бэкап баз с реплики потаблично (mysqldump)

#crontab:
#Посмотреть результат выполнения
#sudo journalctl -u cron -n 20 --no-pager

#Для запуска скрипта в /etc/crontab каждую минуту и с записью логов: (0 3 * * * - каждые сутки в 3 ночи)
#* * * * * root /bin/bash /root/git_hw.sh >> /root/my_script.log 2>&1
# + поправить путь SHELL=/bin/bash в /etc/crontab


#set -x

#-e - execute + игнорируем название колонки, чтобы получить число вывод названия таблиц в БД
#mysql -e "SHOW TABLES FROM test;" --skip-column-names

#_________________________________________________________________________________________________________________Выполнение задания:
backup_tables() {
        #Получаем список БД
        db_list=`mysql -e "SHOW DATABASES;" --skip-column-names`

        #Создаем папку для бэкапа (#+%F аналог +%Y-%m-%d)
        #backup_dir="./mysql_backup_$(date +%F)"
        backup_dir="./mysql_backup_$(date +%Y-%m-%d_%H-%M)"

        #-p, --parents
        #    no error if existing, make parent directories as needed, with their file modes unaffected by any -m option.
        mkdir -p $backup_dir

        #Перебираем каждую БД из списка
        for db in $db_list
        do
                #Получаем список таблиц в конкретной БД:
                table_list=`mysql -e "SHOW TABLES FROM $db;" --skip-column-names`

                #Создаем подпапку для каждой БД
                mkdir -p $backup_dir/$db

                #Выполняем операцию бэкапа по каждой таблицы из БД
                for table in $table_list
                do
                        mysqldump "$db" "$table" > "$backup_dir/$db/$table.sql"
                done
        done
}
#_________________________________________________________________________________________________________________
#Реализация Here-doc (help) для скрипта: (basename - печатает последний компонент в пути к файлу, то есть имя файла)
show_help() {
        cat << EOF

Использование скрипта: $(basename "$0")

Описание:
   Этот скрипт выполняет бэкап потаблично из каждой БД на сервере в соответствующую директорию.

   Краткая информация по алгоритму работы:
        1. Получаем списоб БД на сервере через переменную db_list. Если нужно бэкапить только конкретные, то прописываем руками список.
        2. Подготавливаем директорию под бэкапы.
        3. Через цикл for перебираем каждую БД из списка db_list, получаем список таблиц table_list в БД, создаем подпапку для соответствующей БД.
        4. Перебираем через цикл for список таблиц в БД и сохраняем каждую таблицу в соответствующую директорию с названием самой таблицы.

EOF
}
#_________________________________________________________________________________________________________________
#Если 1-ый параметр не ввели, то запускается функция скрипта, если не пустой и там есть значение для справки, то выводит Here-doc
if [ -z $1 ]
then
        backup_tables
else
        #Если первым параметром был введен help или h, то выводим информацию по скрипту.
        if [[ $1 = "-help" || $1 = "help" || $1 = "-h" || $1 = "h" ]]
        then
                show_help
        else
                echo "Для отображение справки по скрипту введите '$0 -help' или '$0 help' или '$0 -h' или '$0 h'"
                exit 2
        fi
fi
